#include "includes.h"

UART_TRANS_T  stComTrans;


/**********************************************************************************************************
*	函 数 名: SetComRcvNewFlg
*	功能说明: 设置接收标志
*	形    参: 1 or 0
*	返 回 值: NULL
**********************************************************************************************************/
void SetComRcvNewFlg (unsigned char _cFlg)
{
    stComTrans.RxNewFlag = _cFlg;
}

/**********************************************************************************************************
*	函 数 名: IsComRcvNew
*	功能说明: 在中断中判断是否可以接收下一帧
*	形    参: NULL
*	返 回 值: 1 or 0
**********************************************************************************************************/
unsigned char IsComRcvNew (void)
{
    return stComTrans.RxNewFlag;
}


/**********************************************************************************************************
*	函 数 名: IsComRcvDone
*	功能说明: 判断通讯请求帧一帧是否接收完成
*	形    参: _cDat 中断接收数据
*	返 回 值: 1 接收完成，0 未接收完成
**********************************************************************************************************/
unsigned char IsComRcvDone(unsigned char _cDat)
{
    return IsModsRecvDone(&stComTrans,_cDat);
}


/**********************************************************************************************************
*	函 数 名: Com_Recv_Analysis
*	功能说明: 通讯请求解析处理
*	形    参: NULL
*	返 回 值: NULL
**********************************************************************************************************/
static void Com_Recv_Analysis(void)
{
    Mods_Recv_Analysis(&stComTrans);
}

/**********************************************************************************************************
*	函 数 名: Com_Resp_Send
*	功能说明: 通讯请求应答处理
*	形    参: NULL
*	返 回 值: NULL
**********************************************************************************************************/
static void Com_Resp_Send(void)
{

    Uart_SendData(UARTPORT_COM,stComTrans.TxBuf,stComTrans.TxCount);

}

/**********************************************************************************************************
*	函 数 名: Com_DataInit
*	功能说明: 通讯数据缓存，接收标志初始化
*	形    参: NULL
*	返 回 值: NULL
**********************************************************************************************************/
void Com_DataInit(void)
{
    memset(&stComTrans,0,sizeof(stComTrans));
	stComTrans.RxNewFlag = 1;
}

/**********************************************************************************************************
*	函 数 名: App_Comm
*	功能说明: App_Comm function
*	形    参: argument   数据指针
*	返 回 值: NONE
**********************************************************************************************************/
void App_Comm(void *pvParameters)
{
    TickType_t sMaxBlockTime =	pdMS_TO_TICKS(1000);
    
    Com_DataInit();
    
    while(1) 
    {      
        if(xSemaphoreTake(CommSem,sMaxBlockTime) == pdTRUE)
        {
            Com_Recv_Analysis();//请求解析

            Com_Resp_Send();//应答发送

            Com_DataInit();//解析完后清空缓冲区

            LOG_PRINT(DEBUG_TASK,"App_Comm \r\n");

            vTaskDelay(sMaxBlockTime);
        }
    }
}

