#include "includes.h"

/*
*********************************************************************************************************
*	函 数 名: Mods_UHUL_TO_U16
*	功能说明: 字符转换
*	形    参: _cPtr   数据指针
*	返 回 值: short数据
*********************************************************************************************************
*/
uint16_t Mods_UHUL_TO_U16(uint8_t *_cptr)
{
    uint16_t shTemp = 0;
    
    shTemp = _cptr[0];
    shTemp = shTemp << 8 | _cptr[1];
    
    return shTemp;
}

/*
*********************************************************************************************************
*	函 数 名: UHUL_TO_U16
*	功能说明: 字符转换
*	形    参: _cPtr   数据指针
*	返 回 值: short数据
*********************************************************************************************************
*/
uint16_t Mods_ULUH_TO_U16(uint8_t *_cptr)
{
    uint16_t shTemp = 0;
    
    shTemp = _cptr[1];
    shTemp = shTemp << 8 | _cptr[0];
    
    return shTemp;
}

/**********************************************************************************************************
*	函 数 名: ModsCRC16
*	功能说明: MODBUS CRC计算
*	形    参: _cPtr   数据指针
*           _shLen  数据长度
*	返 回 值: CRC
**********************************************************************************************************/
uint16_t ModsCRC16(const uint8_t *_cPtr,uint16_t _shLen)
{
	uint16_t i,j;
	uint16_t shCRC = 0xFFFF;
	
	for(i=0;i<_shLen;i++)
	{
		shCRC ^= _cPtr[i];
        for(j=0;j<8;j++)
		{
			if(shCRC & 0x01)
			{ 
				shCRC = (shCRC>>1) ^ 0xA001;
			}
			else
			{
				shCRC = shCRC>>1;
			}	
		}
	}
	return shCRC;
}

